Tester1cExpansion/src/InformationRegisters/Tester_ШаблонныеДанные/Tester_ШаблонныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Tester_ШаблонныеДанные</name>
  <resources>
    <name>ХранилищеШаблонныхДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблоннаяСхема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>UIDОбъекта</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester1cExpansion/src/InformationRegisters/Tester_ШаблонныеДанные/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Для каждого зап из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(зап.НаименованиеШаблона) Тогда
			Отказ = Истина;
			Сообщить("Попытка записи шаблона без имени.");
			Возврат;
		КонецЕсли;
		зап.ПредставлениеUID = Строка(зап.UIDОбъекта);
		зап.ЭтоШаблоннаяСхема = РегистрыСведений.Tester_ШаблонныеДанные.ЭтоХранилищеШаблонныхДанных(зап.ХранилищеШаблонныхДанных);	
	КонецЦикла	
КонецПроцедуры
